posts/2009-08-20-when-you-realize-that-you-that-you-cant-have-more.org
#+date: <2009-08-20>
#+filetags: quotes philosophy
#+title: Hugh Dancy on Philosophy

The son of philosopher Jonathan Dancy, explaining on [[http://www.hulu.com/watch/88876/the-tonight-show-with-conan-obrien-hugh-dancy][/The Tonight Show/]]
why he did not choose philosophy as a profession:

#+begin_quote
When you realize that you that you can't have more than a five second conversation with your dad before you're lost, you find another line of work.
#+end_quote

#+ATTR_HTML: :class source
Hugh Dancy






#+begin_tagline
Tagged: quotes philosophy
#+end_tagline
