docs/posts/2009-08-20-when-you-realize-that-you-that-you-cant-have-more.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 08, 2025 05:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hugh Dancy on Philosophy</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Hugh Dancy on Philosophy</h1>
<p class="subtitle" role="doc-subtitle">Aug 20, 2009 00:00</p>
</header><p>
The son of philosopher Jonathan Dancy, explaining on <a href="http://www.hulu.com/watch/88876/the-tonight-show-with-conan-obrien-hugh-dancy"><i>The Tonight Show</i></a>
why he did not choose philosophy as a profession:
</p>

<blockquote>
<p>
When you realize that you that you can&rsquo;t have more than a five second conversation with your dad before you&rsquo;re lost, you find another line of work.
</p>
</blockquote>

<p class="source">
Hugh Dancy
</p>






<div class="tagline" id="org92efde5">
<p>
Tagged: <a href="../tags/quotes.html">Quotes</a> <a href="../tags/philosophy.html">Philosophy</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 08, 2025 05:11.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
